In [3]:
import pandas as pd
obj = pd.Series([4,7,-5,3])  # 一维数组  
print(obj)
print(obj.index)             # 下标
print(obj.values)            # 值

0    4
1    7
2   -5
3    3
dtype: int64
RangeIndex(start=0, stop=4, step=1)
[ 4  7 -5  3]

In [9]:
obj2 = pd.Series([4,7,-5,3], index=['a','b','c','d'])
print(obj2)
print(obj2[obj2>0])   # 过滤掉一些数据  
print('b' in obj2)    # cf: 这种写法只针对索引 index  而不针对values

a    4
b    7
c   -5
d    3
dtype: int64
a    4
b    7
d    3
dtype: int64
True
False

In [17]:
sdata = {'Ohio':35000, 'Texas':4343, 'Oregon':3432, 'Utah':5000}
obj3=pd.Series(sdata)
print(obj3)  #  它自动排列了  按照索引的字母来排序的的
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4=pd.Series(sdata, index=states)   # 顺序指定
print(obj4)
print(pd.isnull(obj4))    # 是否为空
print(pd.notnull(obj4))   # 是否不为空

Ohio      35000
Oregon     3432
Texas      4343
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
dtype: float64
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
print(obj3)
print(obj4)
print(obj3 + obj4)  # 一个重要的功能  它能根据索引自动更新数据

Ohio      35000
Oregon     3432
Texas      4343
Utah       5000
dtype: int64
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
dtype: float64
California        NaN
Ohio          70000.0
Oregon         6864.0
Texas          8686.0
Utah              NaN
dtype: float64

In [22]:
obj4.name='population'    # 每个Series都有个name和index.name属性，可以看做是表名 索引总名
obj4.index.name='state' 
obj4

state
California        NaN
Ohio          35000.0
Oregon         3432.0
Texas          4343.0
Name: population, dtype: float64

In [26]:
#======================漂亮的分割线============================#
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
        'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame      # 在jupyter notebook 上显示甚是好看   如果是frame.head  会取前5个显示

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [28]:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [31]:
frame2=pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2    # 如果没有则自动补全为NaN  Not a Number

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [32]:
frame2['state']   # 取一列

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.year   # 表转化成 DataFrame的属性了

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [34]:
frame2.loc['three']   # 取一行

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2['debt']=16.5   # 会给Series全部赋一个值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [38]:
import numpy as np
frame2['debt']=np.arange(6.)   # 把numpy生成集合赋值给一个Series
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [39]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [40]:
frame2['eastern'] = frame2['state']=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [43]:
del frame2['eastern']    # 不能用 frame.eastern 这样的    综上所述  还是用传统比较好 
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
pop = {'Nevada':{2001:2.4,2002: 2.9}, 'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}
frame3 = pd.DataFrame(pop)  # 嵌套字典  =》外层字典的键作为列，内层键则作为行索引
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [47]:
frame3.T   # 转置   二维表沿着正对角线顺时针旋转180°

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [48]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [50]:
pdata={'Ohio':frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7